cmsis-svd/cmsis-svd/data/SiliconLabs/EFM32PG22/EFM32PG22C200F128IM40.svd
        <register>
          <name>SYSCLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x070</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x0001F507</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FSRCO</name>
                  <description>FSRCO is clocking SYSCLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCODPLL</name>
                  <description>HFRCODPLL is clocking SYSCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>HFXO is clocking SYSCLK</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKIN0</name>
                  <description>CLKIN0 is clocking SYSCLK</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCLKPRESC</name>
              <description>PCLK Prescaler</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>PCLK is HCLK divided by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>PCLK is HCLK divided by 2</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HCLKPRESC</name>
              <description>HCLK Prescaler</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>HCLK is SYSCLK divided by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>HCLK is SYSCLK divided by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>HCLK is SYSCLK divided by 4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>HCLK is SYSCLK divided by 8</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>HCLK is SYSCLK divided by 16</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRACECLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000030</resetMask>
          <fields>
            <field>
              <name>PRESC</name>
              <description>TRACECLK Prescaler</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>TRACECLK is SYSCLK divided by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>TRACECLK is SYSCLK divided by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>TRACECLK is SYSCLK divided by 4</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXPORTCLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x090</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1F0F0F0F</resetMask>
          <fields>
            <field>
              <name>CLKOUTSEL0</name>
              <description>Clock Output Select 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>CLKOUT0 is not clocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCLK</name>
                  <description>HCLK is clocking CLKOUT0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFEXPCLK</name>
                  <description>HFEXPCLK is clocking CLKOUT0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO is clocking CLKOUT0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO is clocking CLKOUT0</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking CLKOUT0</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCODPLL</name>
                  <description>HFRCODPLL is clocking CLKOUT0</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>HFXO is clocking CLKOUT0</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSRCO</name>
                  <description>FSRCO is clocking CLKOUT0</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKOUTSEL1</name>
              <description>Clock Output Select 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>CLKOUT1 is not clocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCLK</name>
                  <description>HCLK is clocking CLKOUT1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFEXPCLK</name>
                  <description>HFEXPCLK is clocking CLKOUT1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO is clocking CLKOUT1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO is clocking CLKOUT1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking CLKOUT1</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCODPLL</name>
                  <description>HFRCODPLL is clocking CLKOUT1</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>HFXO is clocking CLKOUT1</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSRCO</name>
                  <description>FSRCO is clocking CLKOUT1</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKOUTSEL2</name>
              <description>Clock Output Select 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>CLKOUT2 is not clocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCLK</name>
                  <description>HCLK is clocking CLKOUT2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFEXPCLK</name>
                  <description>HFEXPCLK is clocking CLKOUT2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO is clocking CLKOUT2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO is clocking CLKOUT2</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking CLKOUT2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCODPLL</name>
                  <description>HFRCODPLL is clocking CLKOUT2</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>HFXO is clocking CLKOUT2</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSRCO</name>
                  <description>FSRCO is clocking CLKOUT2</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESC</name>
              <description>EXPORTCLK Prescaler</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPLLREFCLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>DPLLREFCLK is not clocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>HFXO is clocking DPLLREFCLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking DPLLREFCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKIN0</name>
                  <description>CLKIN0 is clocking DPLLREFCLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EM01GRPACLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x120</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRCODPLL</name>
                  <description>HFRCODPLL is clocking EM01GRPACLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>HFXO is clocking EM01GRPACLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSRCO</name>
                  <description>FSRCO is clocking EM01GRPACLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EM01GRPBCLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x124</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRCODPLL</name>
                  <description>HFRCODPLL is clocking EM01GRPBCLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>HFXO is clocking EM01GRPBCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSRCO</name>
                  <description>FSRCO is clocking EM01GRPBCLK</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKIN0</name>
                  <description>CLKIN0 is clocking EM01GRPBCLK</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCODPLLRT</name>
                  <description>HFRCODPLL (re-timed) is clocking EM01GRPBCLK</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXORT</name>
                  <description>HFXO (re-timed) is clocking EM01GRPBCLK</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EM23GRPACLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x140</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO is clocking EM23GRPACLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking EM23GRPACLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO is clocking EM23GRPACLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EM4GRPACLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x160</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO is clocking EM4GRPACLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking EM4GRPACLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO is clocking EM4GRPACLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IADCCLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EM01GRPACLK</name>
                  <description>EM01GRPACLK is clocking IADCCLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSRCO</name>
                  <description>FSRCO is clocking IADCCLK</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WDOG0CLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO is clocking WDOG0CLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking WDOG0CLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO is clocking WDOG0CLK</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCLKDIV1024</name>
                  <description>HCLKDIV1024 is clocking WDOG0CLK</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EUART0CLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x220</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>UART is not clocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EM01GRPACLK</name>
                  <description>EM01GRPACLK is clocking UART</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EM23GRPACLK</name>
                  <description>EM23GRPACLK is clocking UART</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
